10/data/attachments/a38a4f156c1b4d6f.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Todd_pattern_Friend_67452_4</nif:username>
            <nif:friendToBeRequested>soap_friends_528b1305-2d63-4886-9072-5a84b127039a</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>